{
  "title": "Beyond the Vale of Madness",
  "source": "https://1shotadventures.com/wp-content/uploads/2020/03/Beyond-the-Vale-of-Madness-GURPS.pdf",
  "author": {
    "name": "J.C. Connors"
  },
  "scenes": [
    {
      "id": "1",
      "title": "The Mountain Pass!",
      "content": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "It was already a freezing morning when you set out for the legendary “Castle of Madness” – the mysterious castle that is said to emerge from blizzards once every seven winters. Now, as it grows dark, the mountains’ glacial winds of this valley make the temperature seem hundreds of times colder. Both hands wrap your winter cloak tightly around your body, but somehow you can still feel the ice-sharded winds as if on bare skin."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "You squint your eyes down at your weapon and wonder if it has become frozen to your belt. Nothing alive can possibly live in these temperatures, you reassure yourself, pushing back thoughts of the living dead you’ve heard emerge with the castle."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Soon, you can make out the faint ruined form of the castle up ahead. The old crone’s rotting map was right! Your best guess tells you it’s another hour’s walk in the harsh cold. Before you have time to think about the longer walk, you spot a gaping black opening in the snow. It must be a cave. The crone told you that underground tunnels could also lead into the castle. Could this be one? Or is it the lair of some beast? "
              }
            ]
          }
        ],
        "attrs": {
          "internalChange": true
        }
      },
      "next": [
        {
          "sceneId": 12,
          "text": "Explore the cave"
        },
        {
          "sceneId": 19,
          "text": "Continue your cold trek to the castle"
        }
      ]
    },
    {
      "id": 2,
      "content": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Double-wrapping your hands to protect them from the cold, you dig under some broken statues. In a few minutes you’ve uncovered a beautiful "
              },
              {
                "type": "text",
                "marks": [
                  {
                    "type": "strong"
                  }
                ],
                "text": "antique mace"
              },
              {
                "type": "text",
                "text": ", its metal head coated in an unusual blue lacquer."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Digging some more, you realize something – the weapon still has a frozen hand attached to it! A second later, your boot brushes aside the remains of the man’s face! The blue skin is cracked and broken. Apparently, some warrior died wielding this mace. "
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Make a Will roll, modified by Fearlessness if you have it. If you succeed, you may pry the weapon lose. Otherwise, you have no stomach for such matters and decide to abandon your search."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "(If you take this mace, it does sw+2 cr damage, requires Axe/Maceskill, requires ST 12, and weighs 5 lbs.)"
              }
            ]
          }
        ],
        "attrs": {
          "internalChange": true
        }
      },
      "next": [
        {
          "sceneId": 14,
          "text": "Go through the servant\\'s door"
        },
        {
          "sceneId": 11,
          "text": "Go through the guardhouse door"
        }
      ],
      "title": "Under the Statues"
    },
    {
      "id": 3,
      "content": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Snow crunching underfoot, you jog along the intact half of the castle. Just as you begin to tire, you spot a broken gateway, where once armored guards stood with tall halberds. The portal lies open and shattered and leads into the courtyard of the castle. You swing under the broken gate and look around. Dozens of statues – most crumbled – litter the courtyard. You see two doors beyond the statue graveyard. The smaller one seems to be a servant’s entrance; the other seems to be a guardhouse door. "
              }
            ]
          }
        ],
        "attrs": {
          "internalChange": true
        }
      },
      "next": [
        {
          "sceneId": 43,
          "text": "Search the courtyard"
        },
        {
          "sceneId": 14,
          "text": "Go through the servant’s door"
        },
        {
          "sceneId": 11,
          "text": "Go through the guardhouse door"
        }
      ],
      "title": "The Broken Gateway"
    },
    {
      "id": 12,
      "content": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "It feels warmer the moment you step into the cave, though the winds make an eerie whining sound throughout these dark tunnels. Fortunately, you had enough foresight to bring a torch. Stretching your numb fingers several times, you take out your tinderbox and light the torch. The heat seems to melt your very face. Taking a deep breath, you walk down the winding tunnels making mental notes of its rock formations in case you get lost. It seems as if someone, or something, walked these tunnels in the recent weeks. In a few minutes, you see that the tunnel turns and branches. "
              }
            ]
          }
        ],
        "attrs": {
          "internalChange": true
        }
      },
      "next": [
        {
          "sceneId": 9,
          "text": "Head down the more trodden path"
        },
        {
          "sceneId": 22,
          "text": "Head down the icier path"
        },
        {
          "sceneId": 54,
          "text": "Trod down the warmer, rock path"
        }
      ],
      "title": "The Cave"
    },
    {
      "id": 19,
      "content": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "You stumble another half-hour in the snow. The cave was probably the home to a pack of yetis, or ice trolls. It’s a good thing you avoided it. Unfortunately, the cold winds have begun to take their toll. Reduce your FP by 1 and make a Survival (Mountains) roll. If you fail, you take an additional 1d-3 damage from exhaustion and hypothermia. You stare up at the looming castle. Its stone has been covered with sheets of ice as thick as your body. With any luck, you won’t have to climb up the walls to find an entrance. "
              }
            ]
          }
        ],
        "attrs": {
          "internalChange": true
        }
      },
      "next": [
        {
          "sceneId": 3,
          "text": "Circle around the castle looking for an entrance"
        },
        {
          "sceneId": 35,
          "text": "Use your pitons and rope to climb the wall to a window"
        }
      ],
      "title": "A Freezing Path"
    },
    {
      "id": 35,
      "title": "The Wall Climb",
      "content": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "You remove your rope and grapple and find a nice target – a broken gargoyle near an open window. To climb up the steep, icy castle wall, you’ll need to make a Climbing roll at -3 (or DX-8 or ST-8 if you do not have the skill!). "
              }
            ]
          }
        ],
        "attrs": {
          "internalChange": true
        }
      },
      "next": []
    },
    {
      "id": 14,
      "title": "The Servant's Door",
      "content": "",
      "next": []
    },
    {
      "id": 11,
      "title": "The Guardhouse Door",
      "content": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "You approach the guardhouse door and push on it. No luck. Apparently, the guardhouse door is either locked or frozen shut."
              }
            ]
          }
        ],
        "attrs": {
          "internalChange": true
        }
      },
      "next": [
        {
          "text": "Use your dagger to try picking the lock",
          "sceneId": "18"
        },
        {
          "text": "Try to force the door open",
          "sceneId": ""
        }
      ]
    },
    {
      "id": "18",
      "title": "Picking the Guardhouse Door",
      "content": {
        "type": "doc",
        "content": [
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "You kneel down in the snow and peer through the keyhole. Just as you suspected... the door is locked with an older type of lock. Several stone pegs keep the door in place. Your knife might be able to do the trick, but it’s formidable."
              }
            ]
          },
          {
            "type": "paragraph",
            "content": [
              {
                "type": "text",
                "text": "Since the door uses an old stone lock, it is easier to defeat than a more modern, iron lock. To pick the lock, make a Lockpicking roll at +2 (or DX-3 if you do not have the skill)"
              }
            ]
          }
        ],
        "attrs": {
          "internalChange": true
        }
      },
      "next": [
        {
          "text": "Success",
          "sceneId": ""
        },
        {
          "text": "Failure: Try breaking down the door",
          "sceneId": "40"
        },
        {
          "text": "Go to the servant's door",
          "sceneId": 14
        }
      ]
    },
    {
      "id": "40",
      "title": "Forcing the Guardhouse Door",
      "content": "",
      "next": []
    }
  ]
}
